SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DEE_JUB_45675
	comment ( New Model by Danny Gilbert )  
	comment ( Copyright 2015 )
	Type ( Engine )
	WagonShape ( DEE_JUB_45675.s )
	Size  ( 2.75421m 4.02359m 12.2m )
	CentreOfGravity ( 0.0m 0.0m 0.0m )
	Centre ( 1.4534e-007m 1.99093m -0.233251m )
	
	Mass ( 83.0t )
 InertiaTensor ( Box(2.64m 3.9m 11.8m ) )
 Coupling (
 Type ( Automatic )
 Spring (
 Stiffness ( 1e7N/m 1e7N/m )
 Damping ( 0.2e7N/m/s 0.2e7N/m/s )
 Break ( 6e5N 6e5N )
 r0 ( 10mm 15mm )
 )
 CouplingHasRigidConnection ( 1 )
 Velocity ( 0.1m/s )
 
 )
	
		Adheasion ( 0.4 0.3 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 400kN )
 WheelRadius ( 0.5m )
 NumWheels ( 4 )
 Friction (
  9233.7N/m/s    0    6.0mph    9.063N/m/s    1.910
  5.1N/rad/s  1  -1rad/s  0  1
 )
 
 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 100000N )
 MaxHandbrakeForce( 90000kN )
 NumberOfHandbrakeLeverSteps( 25 )
 MaxReleaseRate( 5 )
 MaxApplicationRate( 5 )
 MaxAuxilaryChargingRate( 21 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )        
 
    Sound ( "..\\..\\common.sound\\3cyl_generic\\3c-60b-engpas99-RScot.sms" )

    Lights ( 8
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 1.9 -5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( -0 1.9 -4.85 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )
  Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 3.2 -4.97550 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.35 )
     )
    )
   )
  Light (
   comment( Flickering Ashpan Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.4 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.45 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )

  Light (
   comment( Sphere of light for Exhaust )
   Type  ( 1 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   Cycle  ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 10.0 -14.75 )
   Transition ( 0 )
   Radius ( 6.0 )
   Angle ( 90.0 )
                               )
                         )
         )
  Light ( 
   comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 01.4 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.4 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
                  )
               )
          )

  Light ( 
   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.4 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.10 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.10 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.4 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.130 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.535 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.5135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.4)
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.1233 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.123 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.123 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.1230 ) 
                  )
               )
          )
  
    Light (
   comment( light bright )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   Coupling ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( 80ffff70 )
   Position ( 1.0 1.52 5.75 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 0.25 )
    )
   
   )
  )
  Light (
   comment( light bright )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   Coupling ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( 80ffff70 )
   Position ( -1.0 1.52 5.75 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 0.25 )
    )
   
   )
  )

   )
 )



Engine ( DEE_JUB_45675  
	Effects (
		SteamSpecialEffects
		(
			
			WhistleFX
   (
    0.0 4.1 -4.15
    0 -0.75 1
    0.2
   )

   SafetyValvesFX
   (
    0 4.3 -3.02
    0 -0.75 0
    0.4
   )
   SafetyValvesFX
   (
    0 3.8 -3.02
    0 1.3 0
    0.2
   )
   StackFX
   (
    0 4.1 3.7
    0 0.9 0
    0.3
   )

   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )

   CylindersFX
   (
    -1.3 0.6 4.4
    0 -0.4 1.3
    0.1
   )

   CylindersFX
   (
    1.3 0.6 4.4
    0 -0.4 1.3
    0.1
   )
  )
 )


	Wagon ( DEE_JUB_45675 )
	IsTenderRequired( 1 ) 
 Type ( Steam )
 MaxPower ( 1343hp )
 MaxForce ( 33150lbf )
 MaxVelocity ( 110mph )
 WheelRadius ( 40.5in )
 Sanding ( 1e9mph )
 NumWheels ( 6 )
 BoilerLength ( 7.2m )
 BoilerRadius ( 0.81m )
 BoilerVolume ( "465231*(in^3)")
 BoilerEffectivity ( 1.25 )
 DraftingEffect ( 1.35 )
 BoilerResponsiveness ( 1 )
 CoalBurnage ( 7.0lb/hp/h )
 MaxBoilerOutput ( 31550lb/h )
 NumCylinders ( 3 )
 CylinderStroke ( 26in )
 CylinderDiameter ( 18in )
 CylinderVolume ( "19837*(in^3)" )
 CylinderEffectivity ( 6 )
 CutoffMaxReverse( -0.78 )
 CutoffMaxForward( 0.78 )
 InjectorSizes ( 11mm 10mm )
 ExhaustLimit ( 32550lb/h )
 PrimingFactor ( 1 )
 SteamMinPrimingLevel ( 1 )
 SteamPrimingPowerLossProportion ( 0.20 )
 SteamPrimingWaterUsageIncreaseProportion ( 0.25 )
 SteamPrimingInjectorsFailAtLevel ( 1.25 )
 SteamPrimingReductionWithCylinderCocksOpen ( 0.25 )
 BlastExponent ( 0.50 )
 MaxBoilerPressure ( 250psi )
 Firebox ( 10ft )
 MaxFireMass ( 2800lb )
 IdealFireMass ( 2750lb )
 MaxWaterMass ( 5720lb )  
 SafetyValvesSteamUsage ( 6000lb/h )
 ShovelCoalMass ( 20lb )
 SmokeCombustion ( 20.0 )
 MaxTenderCoalMass ( 20160lb )
 MaxTenderWaterMass ( 40000lb )
 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes( 0 1 ) 
 SuperHeater ( 1.23 )
 SteamSmokeUnitsPerPoundOfFuel( 0.8 )
 SteamMaxSmokeUnitsReleaseRate( 20 )
 MaxSteamHeatingPressure( 50 )
 SafetyValvePressureDifference( 5 )
 SteamGaugeGlassHeight( 10 )
 SteamFiremanMaxPossibleFiringRate( 4480 )

 BasicSteamUsage ( 750lb/h )
 BasicCoalUsage ( 112lb/h )
 comment( min steam pressure, min water proportion, max water proportion  )
 InjectorLimits1 ( 50psi 0.4 1 )
 InjectorLimits2 ( 60psi 0.4 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 VacuumBrakesSmallEjectorPowerRating( 21 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 410 )
 VacuumBrakesLargeEjectorUsageRate( 520 )
 VacuumBrakesHasVacuumPump( 0 )

 TrainBrakesControllerMaxReleaseRate( 0.75 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )
 BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )

 SteamWaterScoopMinPickupSpeed( 30 ) comment( mph )
 SteamWaterScoopMaxPickupSpeed( 70 ) comment( mph )
 SteamWaterScoopResistance( 8500N )
 comment( pounds per second. 2000gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 2000 )

 SteamSmallestCutoff( 6 )
 NumberOfDamperSteps( 6 )

  RegulatorValveType ( Twin_port )
  RegulatorSecondValveStartPosition( 0.95 )
  RegulatorPilotValveExponent( 0.5 )
  RegulatorSecondValveExponent( 1.75 )
  RegulatorPilotValveFullOpenning( 0.95 )
  RegulatorMainValveInitialOpenning( 0.97 )


 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 1500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.13 )

 
 CabView ( 5xp.cvf)
 HeadOut (  -1.4 3.0 -5.4 )

        EngineControllers (
            comment( Engine controls )
        
            Regulator ( 0 1 0.02 0 
                NumNotches( 0 )
            )
            Cutoff    ( -0.78 0.78 0.01 0 
                NumNotches( 0 )
            )
            Brake_Train ( 0 0.99 0.0475 0.65 
            NumNotches( 4
            Notch( 0     0 TrainBrakesControllerReleaseStart )
            Notch( 0.05  0 TrainBrakesControllerRunningStart )
    		Notch( 0.2   0 TrainBrakesControllerSelfLapStart )
            Notch( 0.3   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.1 1 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.02 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.25 0 
                NumNotches( 0 )
            )
            Shovel ( 0 2 0.5 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                    Notch ( 0      0 Dummy )
                    Notch ( 0.15   0 Dummy )
                    Notch ( 0.25   0 Dummy )
                    Notch ( 0.5    0 Dummy )
                    Notch ( 0.75   0 Dummy )
             	  Notch ( 1  0 Dummy )
         )
      )
            DampersBack ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 0.75 0 )
            Injector1Water ( 0 1 0.25 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.25 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables( 770 2800 4400 255 0.9 40000 75 20 1 0.75 )
     Sound ( "..\\..\\common.sound\\3cyl_generic\\3c-60b-cab99.sms" )


    	Name ( "DEE_JUB_45675" )
 	Description (
 	"Hardy was completed in December 1935. It was one of the last of class to be finally withdrawn in June 1967."
	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)
